# CODING TASK #1. PANDAS DATAFRAME 101

In [3]:
# Pandas is a data manipulation and analysis tool that is built on Numpy.
# Pandas uses a data structure known as DataFrame (think of it as Microsoft excel in Python). 
# DataFrames empower programmers to store and manipulate data in a tabular fashion (rows and columns).
# Series Vs. DataFrame? Series is considered a single column of a DataFrame.

import pandas as pd

In [4]:
# Let's define a two-dimensional Pandas DataFrame
# Note that you can create a pandas dataframe from a python dictionary
employee_df = pd.DataFrame({'Employee ID':[1, 2, 3, 4], 
                            'Employee Name':['Laila Aly', 'Kate Steve', 'Nicole Mitch', 'Francis Morris'], 
                            'Annual Salary [$]':[35000, 40000, 100000, 25000], 
                            'Years with Company':[5, 7, 10, 1]})
employee_df

   Employee ID   Employee Name  Annual Salary [$]  Years with Company
0            1       Laila Aly              35000                   5
1            2      Kate Steve              40000                   7
2            3    Nicole Mitch             100000                  10
3            4  Francis Morris              25000                   1

In [5]:
# Let's obtain the data type 
type(employee_df)

pandas.core.frame.DataFrame

In [8]:
# you can only view the first couple of rows using .head()
employee_df.head(3)

   Employee ID Employee Name  Annual Salary [$]  Years with Company
0            1     Laila Aly              35000                   5
1            2    Kate Steve              40000                   7
2            3  Nicole Mitch             100000                  10

In [9]:
# you can only view the last couple of rows using .tail()
employee_df.tail(1)

   Employee ID   Employee Name  Annual Salary [$]  Years with Company
3            4  Francis Morris              25000                   1

In [10]:
# You can obtain the shape of the DataFrame (#rows, #columns)
employee_df.shape

(4, 4)

**PRACTICE OPPORTUNITY #1 [OPTIONAL]:**
- **A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)**
- **Calculate the total value of the porfolio including all stocks**

# CODING TASK #2. READ CSV DATA USING PANDAS AND PERFORM STATISTICAL DATA ANALYSIS

In [18]:
# Pandas is used to read a csv file and store data in a DataFrame
employee_df = pd.read_csv('employee_information.csv')

In [19]:
employee_df

,First Name,Last Name,Salary,Years with Company,Postal Code,Email
0,Mike,Moe,5000.00,3,N94 3M0,bird@gmail.com
1,Noah,Ryan,10000.00,8,N8S 14K,nsmall@hotmail.com
2,Nina,Keller,9072.02,17,S1T 4E6,azikez@gahew.mr
3,Chanel,Steve,11072.02,12,N7T 3E6,chanel@gmail.com
4,Kate,Noor,5000.00,23,K8N 5H6,kate@hotmail.com
5,Samer,Mo,100000.00,13,J7H 3HY,samer@gmail.com
6,Heba,Steve,50000.00,7,K8Y 3M8,heba.ismail@hotmail.com
7,Laila,Aly,20000.00,5,J8Y 3M0,Laila.a@hotmail.com
8,Joseph,Patton,2629.13,2,M6U 5U7,daafeja@boh.jm
9,Noah,Moran,8626.96,11,K2D 4M9,guutodi@bigwoc.kw

In [20]:
employee_df.describe()

              Salary  Years with Company
count      10.000000            10.00000
mean    22140.013000            10.10000
std     30613.044026             6.52261
min      2629.130000             2.00000
25%      5906.740000             5.50000
50%      9536.010000             9.50000
75%     17768.005000            12.75000
max    100000.000000            23.00000

**PRACTICE OPPORTUNITY #2 [OPTIONAL]:**
- **Calculate the average salary and years with company using two different methods**

# CODING TASK #3. SETTING/RESETTING PANDAS DATAFRAME INDEX

In [31]:
# Pandas is used to read a csv file and store data in a DataFrame
# Note that a numeric index is being set by default
employee_df = pd.read_csv('employee_information.csv')
employee_df

,First Name,Last Name,Salary,Years with Company,Postal Code,Email
0,Mike,Moe,5000.00,3,N94 3M0,bird@gmail.com
1,Noah,Ryan,10000.00,8,N8S 14K,nsmall@hotmail.com
2,Nina,Keller,9072.02,17,S1T 4E6,azikez@gahew.mr
3,Chanel,Steve,11072.02,12,N7T 3E6,chanel@gmail.com
4,Kate,Noor,5000.00,23,K8N 5H6,kate@hotmail.com
5,Samer,Mo,100000.00,13,J7H 3HY,samer@gmail.com
6,Heba,Steve,50000.00,7,K8Y 3M8,heba.ismail@hotmail.com
7,Laila,Aly,20000.00,5,J8Y 3M0,Laila.a@hotmail.com
8,Joseph,Patton,2629.13,2,M6U 5U7,daafeja@boh.jm
9,Noah,Moran,8626.96,11,K2D 4M9,guutodi@bigwoc.kw

In [34]:
# You can assign a specific column to be the index as follows
employee_df.set_index("First Name", inplace = True)

In [35]:
employee_df

,Last Name,Salary,Years with Company,Postal Code,Email
First Name,,,,,
Mike,Moe,5000.00,3,N94 3M0,bird@gmail.com
Noah,Ryan,10000.00,8,N8S 14K,nsmall@hotmail.com
Nina,Keller,9072.02,17,S1T 4E6,azikez@gahew.mr
Chanel,Steve,11072.02,12,N7T 3E6,chanel@gmail.com
Kate,Noor,5000.00,23,K8N 5H6,kate@hotmail.com
Samer,Mo,100000.00,13,J7H 3HY,samer@gmail.com
Heba,Steve,50000.00,7,K8Y 3M8,heba.ismail@hotmail.com
Laila,Aly,20000.00,5,J8Y 3M0,Laila.a@hotmail.com
Joseph,Patton,2629.13,2,M6U 5U7,daafeja@boh.jm
Noah,Moran,8626.96,11,K2D 4M9,guutodi@bigwoc.kw

In [36]:
# You can go back and use numeric index using reset_index
employee_df.reset_index(inplace = True)
employee_df

,First Name,Last Name,Salary,Years with Company,Postal Code,Email
0,Mike,Moe,5000.00,3,N94 3M0,bird@gmail.com
1,Noah,Ryan,10000.00,8,N8S 14K,nsmall@hotmail.com
2,Nina,Keller,9072.02,17,S1T 4E6,azikez@gahew.mr
3,Chanel,Steve,11072.02,12,N7T 3E6,chanel@gmail.com
4,Kate,Noor,5000.00,23,K8N 5H6,kate@hotmail.com
5,Samer,Mo,100000.00,13,J7H 3HY,samer@gmail.com
6,Heba,Steve,50000.00,7,K8Y 3M8,heba.ismail@hotmail.com
7,Laila,Aly,20000.00,5,J8Y 3M0,Laila.a@hotmail.com
8,Joseph,Patton,2629.13,2,M6U 5U7,daafeja@boh.jm
9,Noah,Moran,8626.96,11,K2D 4M9,guutodi@bigwoc.kw

In [37]:
# Alternatively, you can set the index name when you read the csv file as follows
employee_df = pd.read_csv('employee_information.csv', index_col = 'First Name')
employee_df

,Last Name,Salary,Years with Company,Postal Code,Email
First Name,,,,,
Mike,Moe,5000.00,3,N94 3M0,bird@gmail.com
Noah,Ryan,10000.00,8,N8S 14K,nsmall@hotmail.com
Nina,Keller,9072.02,17,S1T 4E6,azikez@gahew.mr
Chanel,Steve,11072.02,12,N7T 3E6,chanel@gmail.com
Kate,Noor,5000.00,23,K8N 5H6,kate@hotmail.com
Samer,Mo,100000.00,13,J7H 3HY,samer@gmail.com
Heba,Steve,50000.00,7,K8Y 3M8,heba.ismail@hotmail.com
Laila,Aly,20000.00,5,J8Y 3M0,Laila.a@hotmail.com
Joseph,Patton,2629.13,2,M6U 5U7,daafeja@boh.jm
Noah,Moran,8626.96,11,K2D 4M9,guutodi@bigwoc.kw

**PRACTICE OPPORTUNITY #3 [OPTIONAL]:**
- **Load the employee_information.csv and then set the "Last Name" column as the index**

# FINAL CAPSTONE PROJECT

- **In this project, we will perform basic Exploratory Data Analysis (EDA) on the University Admissions Dataset**
- **Using the "university_admision.csv" included in the course package, write a python script to perform the following tasks:**
    - **1. Import the "university_admission.csv" file using Pandas** 
    - **2. Display the first and last 8 rows in the DataFrame**
    - **3. Obtain the shape of the DataFrame**
    - **4. Calculate the average, min and max values for the LOR and SOP Columns**
    - **5. Use the GRE Score as the pandas dataframe index**
- **Columns definitions are as listed below:**
    - GRE Scores (out of 340)
    - TOEFL Scores (out of 120)
    - University Rating (out of 5)
    - Statement of Purpose (SOP) 
    - Letter of Recommendation (LOR) Strength (out of 5)
    - Undergraduate GPA (out of 10)
    - Research Experience (either 0 or 1)
    - Chance of admission (ranging from 0 to 1)

# EXCELLENT JOB!

# PRACTICE OPPORTUNITIES SOLUTIONS

**PRACTICE OPPORTUNITY #1 SOLUTION:**
- **A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)**
- **Calculate the total value of the porfolio including all stocks**

In [ ]:
portfolio_df = pd.DataFrame({'stock ticker symbols':['FB', 'TSLA', 'T'],
                             'price per share [$]':[3800, 300, 400], 
                             'Number of stocks':[4, 7, 10]})
portfolio_df

In [ ]:
stocks_dollar_value = portfolio_df['price per share [$]'] * portfolio_df['Number of stocks']
print(stocks_dollar_value)

In [ ]:
print('Total portfolio value = {}'.format(stocks_dollar_value.sum()))

**PRACTICE OPPORTUNITY #2 SOLUTION:**
- **Calculate the average salary and years with company using a different method**

In [22]:
employee_df['Salary'].mean()

22140.013

In [ ]:
employee_df['Years with Company'].mean()

In [21]:
employee_df['Salary'].sum()/employee_df['Salary'].count()

22140.013

In [ ]:
employee_df['Years with Company'].sum()/employee_df['Years with Company'].count()

**PRACTICE OPPORTUNITY #3 SOLUTION:**
- **Load the employee_information.csv and then set the "Last Name" column as the index**

In [ ]:
employee_df = pd.read_csv('employee_information.csv')
employee_df

In [ ]:
# You can assign a specific column to be the index as follows
employee_df.set_index("Last Name", inplace = True)
employee_df

# PROJECT SOLUTION

- **In this project, we will perform basic Exploratory Data Analysis (EDA) on the University Admissions Dataset**
- **Using the "university_admision.csv" included in the course package, write a python script to perform the following tasks:**
    - **1. Import the "university_admission.csv" file using Pandas** 
    - **2. Display the first and last 8 rows in the DataFrame**
    - **3. Obtain the shape of the DataFrame**
    - **4. Calculate the average, min and max values for the LOR and SOP Columns**
    - **5. Use the GRE Score as the pandas dataframe index**
- **Columns definitions are as listed below:**
    - GRE Scores (out of 340)
    - TOEFL Scores (out of 120)
    - University Rating (out of 5)
    - Statement of Purpose (SOP) 
    - Letter of Recommendation (LOR) Strength (out of 5)
    - Undergraduate GPA (out of 10)
    - Research Experience (either 0 or 1)
    - Chance of admission (ranging from 0 to 1)

In [40]:
import pandas as pd

In [41]:
# Read the CSV file 
university_df = pd.read_csv("university_admission.csv")

In [42]:
# Load the top 8 instances
university_df.head(8)

,GRE_Score,TOEFL_Score,University_Rating,SOP,LOR,CGPA,Research,Chance_of_Admission
0,337,118,4,4.5,4.5,9.65,1,0.92
1,324,107,4,4.0,4.5,8.87,1,0.76
2,316,104,3,3.0,3.5,8.00,1,0.72
3,322,110,3,3.5,2.5,8.67,1,0.80
4,314,103,2,2.0,3.0,8.21,0,0.65
5,330,115,5,4.5,3.0,9.34,1,0.90
6,321,109,3,3.0,4.0,8.20,1,0.75
7,308,101,2,3.0,4.0,7.90,0,0.68

In [43]:
# Load the bottom 8 instances 
university_df.tail(8)

,GRE_Score,TOEFL_Score,University_Rating,SOP,LOR,CGPA,Research,Chance_of_Admission
992,298,101,4,2.5,4.5,7.69,1,0.53
993,300,95,2,3.0,1.5,8.22,1,0.62
994,301,99,3,2.5,2.0,8.45,1,0.68
995,332,108,5,4.5,4.0,9.02,1,0.87
996,337,117,5,5.0,5.0,9.87,1,0.96
997,330,120,5,4.5,5.0,9.56,1,0.93
998,312,103,4,4.0,5.0,8.43,0,0.73
999,327,113,4,4.5,4.5,9.04,0,0.84

In [44]:
# Display the feature columns
university_df.columns

Index(['GRE_Score', 'TOEFL_Score', 'University_Rating', 'SOP', 'LOR', 'CGPA',
       'Research', 'Chance_of_Admission'],
      dtype='object')

In [45]:
# Check the shape of the dataframe
university_df.shape

(1000, 8)

In [46]:
# Check if any missing values are present in the dataframe
university_df.isnull().sum()

GRE_Score              0
TOEFL_Score            0
University_Rating      0
SOP                    0
LOR                    0
CGPA                   0
Research               0
Chance_of_Admission    0
dtype: int64

In [47]:
university_df.describe()

,GRE_Score,TOEFL_Score,University_Rating,SOP,LOR,CGPA,Research,Chance_of_Admission
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.00000,1000.000000,1000.00000
mean,316.472000,107.193000,3.114000,3.374000,3.484000,8.57644,0.560000,0.72174
std,11.289494,6.079368,1.142939,0.990507,0.924986,0.60451,0.496635,0.14107
min,290.000000,92.000000,1.000000,1.000000,1.000000,6.80000,0.000000,0.34000
25%,308.000000,103.000000,2.000000,2.500000,3.000000,8.12750,0.000000,0.63000
50%,317.000000,107.000000,3.000000,3.500000,3.500000,8.56000,1.000000,0.72000
75%,325.000000,112.000000,4.000000,4.000000,4.000000,9.04000,1.000000,0.82000
max,340.000000,120.000000,5.000000,5.000000,5.000000,9.92000,1.000000,0.97000

In [48]:
university_df = pd.read_csv('university_admission.csv', index_col = 'GRE_Score')
university_df

,TOEFL_Score,University_Rating,SOP,LOR,CGPA,Research,Chance_of_Admission
GRE_Score,,,,,,,
337,118,4,4.5,4.5,9.65,1,0.92
324,107,4,4.0,4.5,8.87,1,0.76
316,104,3,3.0,3.5,8.00,1,0.72
322,110,3,3.5,2.5,8.67,1,0.80
314,103,2,2.0,3.0,8.21,0,0.65
...,...,...,...,...,...,...,...
332,108,5,4.5,4.0,9.02,1,0.87
337,117,5,5.0,5.0,9.87,1,0.96
330,120,5,4.5,5.0,9.56,1,0.93
312,103,4,4.0,5.0,8.43,0,0.73
327,113,4,4.5,4.5,9.04,0,0.84

# EXCELLENT JOB!